# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders` from the file `Oders.csv` located in the `data` folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [2]:
orders = pd.read_csv("../data/Orders.csv")

orders.head(10)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
5,5,536365,22752,2010,12,3,8,set 7 babushka nesting boxes,2,2010-12-01 08:26:00,7.65,17850,United Kingdom,15.30
6,6,536365,21730,2010,12,3,8,glass star frosted t-light holder,6,2010-12-01 08:26:00,4.25,17850,United Kingdom,25.50
7,7,536366,22633,2010,12,3,8,hand warmer union jack,6,2010-12-01 08:28:00,1.85,17850,United Kingdom,11.10
8,8,536366,22632,2010,12,3,8,hand warmer red polka dot,6,2010-12-01 08:28:00,1.85,17850,United Kingdom,11.10
9,9,536367,84879,2010,12,3,8,assorted colour bird ornament,32,2010-12-01 08:34:00,1.69,13047,United Kingdom,54.08

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [3]:
#in order to simplify work, let's take the columns that we will be using to perform the analysis
orders1 = orders[["CustomerID", "Country", "amount_spent"]]

orders1

        CustomerID         Country  amount_spent
0            17850  United Kingdom         15.30
1            17850  United Kingdom         20.34
2            17850  United Kingdom         22.00
3            17850  United Kingdom         20.34
4            17850  United Kingdom         20.34
...            ...             ...           ...
397919       12680          France         10.20
397920       12680          France         12.60
397921       12680          France         16.60
397922       12680          France         16.60
397923       12680          France         14.85

[397924 rows x 3 columns]

In [6]:
unique_costumers = orders1.groupby(["Country","CustomerID"]).sum()
unique_costumers.head(10)

                      amount_spent
Country   CustomerID
Australia 12386             401.90
          12388            2780.66
          12393            1582.60
          12415          124914.53
          12422             386.20
          12424            1760.96
          12431            5514.67
          12434             806.14
          16321             373.65
Austria   12358            1168.06

In [7]:
unique_costumers["Customer group"] = pd.qcut(unique_costumers["amount_spent"], 
                                             q=[0, 0.75, 0.95, 1], labels=["Normal", "Preferred", "VIP"])

unique_costumers

                           amount_spent Customer group
Country        CustomerID
Australia      12386             401.90         Normal
               12388            2780.66      Preferred
               12393            1582.60         Normal
               12415          124914.53            VIP
               12422             386.20         Normal
...                                 ...            ...
United Kingdom 18287            1837.28      Preferred
Unspecified    12363             552.00         Normal
               12743             546.43         Normal
               14265             530.18         Normal
               16320            1038.46         Normal

[4347 rows x 2 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [8]:
unique_costumers[unique_costumers["amount_spent"] == unique_costumers["amount_spent"].max()]

                        amount_spent Customer group
Country     CustomerID
Netherlands 14646          280206.02            VIP

## Q3: How to identify which country has the most VIP+Preferred Customers combined?